In [1]:
# Python basics
print("Hello, ML World!")

# Variables
x = 10
y = 3.5
name = "Varun"

# Lists
numbers = [1, 2, 3, 4, 5]
print(numbers[0], numbers[-1])  # First and last elements

# Dictionaries
person = {"name": "Varun", "role": "BI"}
print(person["name"])

# Loops
for i in numbers:
    print(i, end=" ")

# Functions
def add(a, b):
    return a + b

print("\nSum:", add(5, 7))

Hello, ML World!
1 5
Varun
1 2 3 4 5
Sum: 12

In [2]:
import pandas as pd

# Create a small DataFrame
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "Score": [85, 90, 88]
}

df = pd.DataFrame(data)
print(df)

# View top rows
print(df.head())

# Summary stats
print(df.describe())

      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     88
      Name  Age  Score
0    Alice   25     85
1      Bob   30     90
2  Charlie   35     88
        Age      Score
count   3.0   3.000000
mean   30.0  87.666667
std     5.0   2.516611
min    25.0  85.000000
25%    27.5  86.500000
50%    30.0  88.000000
75%    32.5  89.000000
max    35.0  90.000000

In [3]:
# Reading from D: drive (make sure the CSV exists)
df_csv = pd.read_csv(r"D:\garbage\following_chatgpt\git\datasets\titanic\test.csv")  # Replace with your file name
print(df_csv.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

In [21]:
# Select one column
#print(df_csv["Name"])

# Filter rows where Age > 50
#print(df_csv[df_csv["Age"]>60])

# Select specific columns
print(df_csv[["Sex", "Pclass"]])

        Sex  Pclass
0      male       3
1    female       3
2      male       2
3      male       3
4    female       3
..      ...     ...
413    male       3
414  female       1
415    male       3
416    male       3
417    male       3

[418 rows x 2 columns]

In [23]:
female_first_class = df_csv[(df_csv["Sex"] == "female") & (df_csv["Pclass"] == 1)]
print(female_first_class[["Name", "Sex", "Pclass"]])

                                                  Name     Sex  Pclass
12       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  female       1
14   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  female       1
22                Flegenheim, Mrs. Alfred (Antoinette)  female       1
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  female       1
26                        Ostby, Miss. Helene Ragnhild  female       1
44    Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)  female       1
48     Bucknell, Mrs. William Robert (Emma Eliza Ward)  female       1
53                          Fortune, Miss. Ethel Flora  female       1
59                         Chaudanson, Miss. Victorine  female       1
69                 Fortune, Mrs. Mark (Mary McDougald)  female       1
74                                Geiger, Miss. Amalie  female       1
77   Cornell, Mrs. Robert Clifford (Malvina Helen L...  female       1
92                Davidson, Mrs. Thornton (Orian Hays)  female       1
96   Cavendish, Mrs. Tyrell William (Julia Florence...  female       1
100  Stengel, Mrs. Charles Emil Henry (Annie May Mo...  female       1
112                           Evans, Miss. Edith Corse  female       1
114             Straus, Mrs. Isidor (Rosalie Ida Blun)  female       1
122                    Schabert, Mrs. Paul (Emma Mock)  female       1
141                               Daniels, Miss. Sarah  female       1
150              Earnshaw, Mrs. Boulton (Olive Potter)  female       1
156                                  Bird, Miss. Ellen  female       1
168  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...  female       1
179  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...  female       1
182  Marvin, Mrs. Daniel Warner (Mary Graham Carmic...  female       1
184  Douglas, Mrs. Frederick Charles (Mary Helene B...  female       1
208                      Rosenbaum, Miss. Edith Louise  female       1
218       Widener, Mrs. George Dunton (Eleanor Elkins)  female       1
224   Candee, Mrs. Edward (Helen Churchill Hungerford)  female       1
231                           Willard, Miss. Constance  female       1
239        Douglas, Mrs. Walter Donald (Mahala Dutton)  female       1
240          Lindstrom, Mrs. Carl Johan (Sigrid Posse)  female       1
272      Clark, Mrs. Walter Miller (Virginia McDowell)  female       1
305  Crosby, Mrs. Edward Gifford (Catherine Elizabe...  female       1
314              White, Mrs. John Stuart (Ella Holmes)  female       1
324                             Kreuchen, Miss. Emilie  female       1
343  Cardeza, Mrs. James Warburton Martinez (Charlo...  female       1
350       Greenfield, Mrs. Leo David (Blanche Strouse)  female       1
356     Brown, Mrs. John Murray (Caroline Lane Lamson)  female       1
364       Harder, Mrs. George Achilles (Dorothy Annan)  female       1
368            Gibson, Mrs. Leonard (Pauline C Boeson)  female       1
371                          Wilson, Miss. Helen Alice  female       1
374              Dodge, Mrs. Washington (Ruth Vidaver)  female       1
375                           Bowen, Miss. Grace Scott  female       1
391     Lines, Mrs. Ernest H (Elizabeth Lindsey James)  female       1
395     Smith, Mrs. Lucien Philip (Mary Eloise Hughes)  female       1
397  Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...  female       1
400                            Bonnell, Miss. Caroline  female       1
402                     Gibson, Miss. Dorothy Winifred  female       1
411    Minahan, Mrs. William Edward (Lillian E Thorpe)  female       1
414                       Oliva y Ocana, Dona. Fermina  female       1

In [25]:
missing_age = df_csv[df_csv["Age"].isna()]
print(missing_age[["Name", "Age"]])

                                                  Name  Age
10                                    Ilieff, Mr. Ylio  NaN
22                Flegenheim, Mrs. Alfred (Antoinette)  NaN
29                                   Samaan, Mr. Elias  NaN
33   Johnston, Mrs. Andrew G (Elizabeth Lily" Watson)"  NaN
36                                 Roth, Miss. Sarah A  NaN
..                                                 ...  ...
408                    Riordan, Miss. Johanna Hannah""  NaN
410                             Naughton, Miss. Hannah  NaN
413                                 Spector, Mr. Woolf  NaN
416                                Ware, Mr. Frederick  NaN
417                           Peter, Master. Michael J  NaN

[86 rows x 2 columns]

In [26]:
male_third_over25 = df_csv[(df_csv["Sex"] == "male") & (df_csv["Pclass"] == 3) & (df_csv["Age"] > 25)]
print(male_third_over25[["Name", "Sex", "Pclass", "Age"]])

                                           Name   Sex  Pclass   Age
0                              Kelly, Mr. James  male       3  34.5
3                              Wirz, Mr. Albert  male       3  27.0
25                      Robins, Mr. Alexander A  male       3  50.0
40                             Karun, Mr. Franz  male       3  39.0
42                        Goldsmith, Mr. Nathan  male       3  41.0
56                              Cor, Mr. Bartol  male       3  35.0
97                    Makinen, Mr. Kalle Edvard  male       3  29.0
99                 Nancarrow, Mr. William Henry  male       3  33.0
103      Johansson Palmquist, Mr. Oskar Leander  male       3  26.0
105                   Holthen, Mr. Johan Martin  male       3  28.0
123                     Carver, Mr. Alfred John  male       3  28.0
130                     Spinner, Mr. Henry John  male       3  32.0
134                      Dintcheff, Mr. Valtcho  male       3  43.0
136                   Zakarian, Mr. Mapriededer  male       3  26.5
139              Goodwin, Mr. Charles Frederick  male       3  40.0
145                   Vander Planke, Mr. Julius  male       3  31.0
152                          Storey, Mr. Thomas  male       3  60.5
171                         Zakarian, Mr. Ortin  male       3  27.0
174  Asplund, Mr. Carl Oscar Vilhelm Gustafsson  male       3  40.0
195           Karlsson, Mr. Julius Konrad Eugen  male       3  33.0
210                 Andersen, Mr. Albert Karvin  male       3  32.0
228                   Everett, Mr. Thomas James  male       3  40.5
254                         Wenzel, Mr. Linhart  male       3  32.5
257                       Niklasson, Mr. Samuel  male       3  28.0
260        de Messemaeker, Mr. Guillaume Joseph  male       3  36.5
285                         Dennis, Mr. William  male       3  36.0
294                   Wittevrongel, Mr. Camille  male       3  36.0
295                        Angheloff, Mr. Minko  male       3  26.0
299                         Johansson, Mr. Nils  male       3  29.0
300                   Olsson, Mr. Oscar Wilhelm  male       3  32.0
318                   Jonsson, Mr. Nils Hilding  male       3  27.0
320                 Andersson, Mr. Johan Samuel  male       3  26.0
334                               Cor, Mr. Ivan  male       3  27.0
337                           Elias, Mr. Joseph  male       3  39.0
341                  Lundstrom, Mr. Thure Edvin  male       3  32.0
363                           Strilic, Mr. Ivan  male       3  27.0
381                           Foley, Mr. Joseph  male       3  26.0
394                    Kink-Heilmann, Mr. Anton  male       3  29.0
399                    Conlon, Mr. Thomas Henry  male       3  31.0
415                Saether, Mr. Simon Sivertsen  male       3  38.5

In [27]:
sorted_by_fare = df_csv.sort_values(by="Fare", ascending=False)
print(sorted_by_fare[["Name", "Fare"]].head(10))  # Top 10 fares

                                                  Name      Fare
343  Cardeza, Mrs. James Warburton Martinez (Charlo...  512.3292
69                 Fortune, Mrs. Mark (Mary McDougald)  263.0000
53                          Fortune, Miss. Ethel Flora  263.0000
59                         Chaudanson, Miss. Victorine  262.3750
64                         Ryerson, Master. John Borie  262.3750
375                           Bowen, Miss. Grace Scott  262.3750
142                         Ryerson, Mr. Arthur Larned  262.3750
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  262.3750
184  Douglas, Mrs. Frederick Charles (Mary Helene B...  247.5208
202                             Astor, Col. John Jacob  227.5250